package com.appsomniacs.roomexample;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.webkit.WebView;
import android.widget.TextView;

import java.io.Serializable;
import java.util.List;

public class DetailsActivity extends AppCompatActivity implements Serializable {
    TextView tvDetailsShowWord, tvDetailsShowMeaning;
    WebView wvMeaning;
    Dictionary wordData;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_details);

        tvDetailsShowWord = findViewById(R.id.tvDetailsShowWord);
        //tvDetailsShowMeaning = findViewById(R.id.tvDetailsShowMeaning);
        wvMeaning = findViewById(R.id.wvMeaning);

//        Intent intent = getIntent();
//        wordData = (Dictionary) intent.getSerializableExtra("meaningsList");



        //tvDetailsShowWord.setText(wordData.getWord());
        //tvDetailsShowMeaning.setText(wordData.getMeaning());


        final String OPEN_HTML_BODY = "<html xmlns=\"http://www.w3.org/1999/xhtml\">\n" +
                " <head>\n" +
                " \n" +
                "\n" +
                "  <style type=\"text/css\">\n" +
                "    @font-face {\n" +
                "       font-family: 'Font';\n" +
                "       src:url(\"file:///android_res/font/a_jameel_noori_nastaleeq.ttf\")\n" +
                "    }\n" +
                "\n" +
                "    body {\n" +
                "       font-family: 'Font', serif;\n" +
                "       font-size: large;\n" +
                "       text-align: justify;\n" +
                "       color:#5d6b64\n" +
                "    }\n" +
                "\n" +
                "  </style> \n" +
                "\n" +
                " </head>\n" +
                "\n" +
                " <body style=\"background-color:#c8e6d7\">\n"
                ;



        final String CLOSE_HTML_BODY = "</body> </html>";



        String body = "یہ عربی اور فارسی حروف تہجّی کا پہلا حرف ہے اہلِ عرب کے نزدِیک\n" +
                "اِس کی آواز زبان کے بے جھٹکا دِئے نکلتی ہَے۔ یہ حرف کسی لفظ کے\n" +
                "درمیان یا آخر میں ہمیشہ ساکِن واقع ہُوا کرتا ہَے ۔ اور اسی لگّا نہ کھانے\n" +
                "کے سبب اِس کا نام الف رکھا گیا۔ چونکہ ابتداء بساکن محال ہے اِس لٸے\n" +
                "نحویوں نے الف بے تے کے پہلے حرف کو ہمزہ مانا اور لام کے ساتھ میں\n" +
                "ایک اتّحاد قلبی کے باعث ملا دیا جِسے لوگ اپنی غلط فہمی سے لام الف کہنے لگے٠\n" +
                "یہ حرف لِکھنے کی حالت میں ایک خطِّ مُستقِیم اور شکل میں گویا چانول کا دانہ\n" +
                "ہَے ۔ حسابِ جُمل میں اِس کا عدد ایک فرض کیا گیا ہَے +\n" +
                "\n" +
                "اگر یہ خطِّ مُستقِیم کِسی لفظ مُتحرّک کے شروع میں آئے یا لفظِ ساکن کے\n" +
                "درمیان یا آخر میں زبان کے جھٹکے سے نِکلے تو ہم بقاعدہ عرب اسی کو ہمزہ\n" +
                "کہیں گے مگر عُرف میں کیا اہلِ عرب کیا اہلِ فارس دونوں حالتوں میں\n" +
                "اِس کو الف ہی کہتے اور لِکھتے ہَیں۔ اس صُورت سے ہم سنسکرت اور ہندی بلکہ انگریزی اور دیگر زبانوں کے پہلے حرف یا اعراب کی آواز کو یہی نیچرل\n" +
                "قاعدہ کے موافق ایک ہی کہہ سکتے ہَیں۔ پس اب یہ سنسکرت کا بھی پہلا اعراب\n" +
                "اور انگریزی کا بھی پہلا حرف ثابِت ہوا۔ مگر چونکہ اِس جگہ ہمنے اس حرف کو\n" +
                "عربی قائم کیا ہے اِس سبب سے یہاں ہم صرف عربی اور اُسی کے ضمن میں\n" +
                " فارسی الف کے بیان سے غرض رکھیں گے۔ اور ہن٘دی کے الف کو اِس\n" +
                " بحث سے الگ رکھیں گے۔ بلکہ عربی و فارسی الف کا بیان بھی وہیں تک ہوگا کہ جہاں تک اُردُو میں کبھی کبھی کام پڑتا ہے۔  یا جس سے آئیندہ فلولجی(علم زبان) میں مدد مِلنے کی امید ہَے۔\n" +
                "عربی میں یہ حرف کبھی تو <b>جمع</b> کے واسطے آتا ہَے۔ جیسے تدابیر نزاکیب۔\n" +
                "عناصِر۔ مساجِد وغَیرہ۔ اور کبھی <b>مُتکلّم</b> کے واسطے جیسے مشققا۔ ملاذا مُحبّا وغیرہ۔\n" +
                "اور کبھی واو کو اُس کی جگہ سے ہٹا کر آپ آن کُودتا ہے۔ جَیسے عصو کا\n" +
                "عصا ہوگیا ۔ اور کبھی <b>یاے تحتائی</b> کی صُورت میں لِکھا جاتا ہَے اور الف کی آواز میں پڑھا جاتا ہَے\u200C۔  جیسے مصطفیٰ اور مرتضیٰ (اصل میں یہاں بھی میں واو تھی ایسی یے کے اوپر تمِیز کے واسطے ایک چھوٹا سا الف یا کھڑا زبر بھی لِکھ دیا کرتے ہَیں) کبھی <b>تانِیث</b> کے واسطے آتا ہے جیسے عُقبیٰ اور دُنیی مگر دُنیا کو مثلِ عُلیا الف سے بھی لِکھتے ہَیں۔\n" +
                "کبھی حالتِ <b>وقف</b> میں تمیز کے واسطے نصبی تنوِین کو بھی الف پڑھا\n" +
                "کرتے ہیں جیسے اصلاً اور اصلا۔ ظاہراً اور ظاہرا۔ بعضوں نے لِکّھا ہَے کہ\n" +
                "نہیں ایک قِسم کا <b>تنوِینی</b> الف بھی ہوتا ہَے۔ اور جِس لفظ پر نصبی تنوِین دینی\n" +
                "منظوُر ہوتی ہے ۔ اُس کو وہاں ضرور لِکھتے ہیں جیسے یقیناً ۔ تمثلاً۔ اثباتاً وغیرہ•\n" +
                "یہی الف مثلِ فارسی اور ہِندی حالت امالہ میں یاے تحتانی سے بھی بدل\n" +
                "جاتا ہے جیسے کِتاب اور کتیب۔ رکاب اور کیب۔ حساب اور حسیب بلکہ  سب سے\n" +
                "بڑی بات یہ ہے۔ کہ جس طرح ہِندی میں یہ حرف کِسی لفظ کے اوّل میں نفی\n" +
                "کے واسطے آتا ہے۔ اسی طرح عربی میں بھی آتا ہے۔ جسے ہمزہءِ سلب کے\n" +
                "نام سے تعبیر کرتے ہیں جیسے افلاس اور اعراب۔ کیونکہ فلس کے معنے پَیسہ کے\n" +
                "تھے جب اس کے اوّل میں ہمزہءِ سلب آ گیا تو اُس نے اِس کے معنے اُلٹ\n" +
                "دۓ یعنی امیر سے غریب بنا دیا ۔ اِسی طرح عربت کے معنے فساد معدہ کے\n" +
                "تھے مگر جب یہ ہمزہ آیا تو اس نے رفع فساد کے معنے کر\n" +
                "دئے یعنی وُہ حُروف\n" +
                "جو عبارت کے فساد کو دُور کریں ۔\n" +
                "\n" +
                "<h4>\n" +
                "اب ہم فارسی الف کی طرف توجّہ کرتے اور دیکھتے ہیں\n" +
                "کہ یہ حضرت کیا کیا گُل کِھلاتے اور ہماری زبان میں\n" +
                "کہاں تک مدد دیتے ہیں۔\n" +
                "</h4>\n" +
                "( فارسی الف صیغہ امر کے آخر میں فاعل کے واسطے آتا ہے۔ جیسے دانا۔ بِینا۔\n" +
                "جویا۔ زیبا۔ گویا۔ توانا۔ شکیا۔اور نیز مفعول کے واسطے آتا ہے جیسے گوارا۔ پزیرا۔\n" +
                "اور اتّصال کے واسطے (دومتجانِس کلموں میں) جیسے رَوارَو۔ دوا دو۔ رن٘گارن٘گ۔\n" +
                "لبالب۔ مالامال۔ شباشب۔ گُوناگُوں۔ عطف کے واسطے جیسے شباروز۔ تگاپُو۔\n" +
                "سراپا۔ تگادو۔ مذبہ کے واسطے جیسے دریغا۔ حسرتا۔ دردا- نِدا کے واسطے(کلمہ\n" +
                "کے آخرمیں) جیسے خداون٘دا۔ جہان٘دارا -شاہا- دِلا۔ جانا وغیرہ )\n" +
                "\n" +
                "اس کے علاوہ یہ الف کبھی اوّل کبھی وسط کبھی اخیر میں زاید\n" +
                "بھی آیا کرتا ہے۔ چُنان٘چہ بالتّرتیب ایک ایک دو دو مِثالیں دی جاتی ہیں۔\n" +
                "\n" +
                "<h4>اوّل</h4> <br></br>\n" +
                "<h5>\n" +
                "نوشابہ - انوشابہ <br></br>\n" +
                "سپر - اِسپر <br></br>\n" +
                "فروغ - افروغ <br></br>\n" +
                "سِکندر - اِسکندر <br></br>\n" +
                "بر - ابر <br></br>\n" +
                "بے - ابے <br></br>\n" +
                "</h5> <br></br>\n" +
                "\n" +
                "<h4>وسط</h4> <h5><br></br>\n" +
                "نمک خور - نمک خوار<br></br>\n" +
                "ستمگر - ستمگار<br></br>\n" +
                "رُستخیز - رُستاخیز<br></br>\n" +
                "نَگوُں سر - نِگون٘سار<br></br>\n" +
                "حرامخور - حرامخور<br></br>\n" +
                "</h5> <br></br>\n" +
                "\n" +
                "<h4>آخر</h4><br></br>\n" +
                "        <h5>\n" +
                "گُفت - گُفتا<br></br>\n" +
                "رفت - رفتا<br></br>\n" +
                "پارس - پارسا<br></br>\n" +
                "سُلطان - سُلطانا<br></br>\n" +
                "درویش - درویشا<br></br>\n" +
                "</h5>\n"
                ;


        String formattedMeaning = OPEN_HTML_BODY + body + CLOSE_HTML_BODY;

        wvMeaning.getSettings().setBuiltInZoomControls(true);
        wvMeaning.getSettings().setDisplayZoomControls(false);

        wvMeaning.loadDataWithBaseURL("", formattedMeaning, "text/html", "utf-8", null);


    }


    public void initializeData(){

        Intent intent = getIntent();
        wordData = (Dictionary) intent.getSerializableExtra("meaningsList");


    }

}